ProgessBase/Documents/ПРГ_ЗакрытиеСчетовПериодаМеждународный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПРГ_ЗакрытиеСчетовПериодаМеждународный</Name>
			<Comment>(Упр)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗатратыМеждународныйУчет</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлОборот76_44</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлОборот76_94</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлЗакрытие94</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлЗакрытие90_91</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флЗакрытияОстатка76_2_2</Name>
					<Comment>68038</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флЗакрытияОстатка76_22</Name>
					<Comment>68038</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флЗакрытияОстатка76_32</Name>
					<Comment>68038</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Comment>Дата формирования проводки регламентной процедурой</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегламентнойОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

ProgessBase/AccountingRegisters/Международный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Международный</Name>
			<Comment>(Упр)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Международный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПервичныйНомерСтроки</Name>
					<Comment>Необходим для переноса затрат</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

ProgessBase/Catalogs/ПРГ_Служебный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПРГ_Служебный</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГ_Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/Documents/ПРГ_ЗакрытиеСчетовПериодаМеждународный/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

Перем мКонДата;
Перем мКонГраница;
Перем мПроводкиМУ;


Процедура ПриведениеОборота76_44_в_соответствиеРСБУ(СтруктураШапкиДокумента, Отказ, Заголовок)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПРГ_СлужебныйТаблицаПараметров.Параметр КАК Счет,
	               |	ПРГ_СлужебныйТаблицаПараметров.ЗначениеПараметра КАК Субконто1,
	               |	ПРГ_СлужебныйТаблицаПараметров.ЗначениеПараметра2 КАК Субконто2
	               |ПОМЕСТИТЬ ТаблАналитики
	               |ИЗ
	               |	Справочник.ПРГ_Служебный.ТаблицаПараметров КАК ПРГ_СлужебныйТаблицаПараметров
	               |ГДЕ
	               |	ПРГ_СлужебныйТаблицаПараметров.Ссылка.Наименование = &НаименованиеАналитики
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПРГ_СлужебныйТаблицаПараметров.Параметр КАК СчетБУ,
	               |	ПРГ_СлужебныйТаблицаПараметров.ЗначениеПараметра КАК СчетМУ,
	               |	ПРГ_СлужебныйТаблицаПараметров.ЗначениеПараметра2 КАК СчетЗатратМУ,
	               |	ТаблАналитики.Субконто1,
	               |	ТаблАналитики.Субконто2
	               |ПОМЕСТИТЬ ТаблСчетов
	               |ИЗ
	               |	Справочник.ПРГ_Служебный.ТаблицаПараметров КАК ПРГ_СлужебныйТаблицаПараметров
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблАналитики КАК ТаблАналитики
	               |		ПО ПРГ_СлужебныйТаблицаПараметров.ЗначениеПараметра2 = ТаблАналитики.Счет
	               |ГДЕ
	               |	ПРГ_СлужебныйТаблицаПараметров.Ссылка.Наименование = &Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Субконто1,
	               |	ВложенныйЗапрос.Субконто2,
	               |	ВложенныйЗапрос.КорСчет,
	               |	ВложенныйЗапрос.КорСубконто1,
	               |	ВложенныйЗапрос.КорСубконто2,
	               |	СУММА(ВложенныйЗапрос.СуммаОборот) КАК РазницаОстатков,
	               |	ВложенныйЗапрос.ДопСубконто1,
	               |	ВложенныйЗапрос.ДопСубконто2
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
	               |		ХозрасчетныйОбороты.Субконто2 КАК Субконто2,
	               |		ТаблСчетов.СчетЗатратМУ КАК КорСчет,
	               |		ВЫБОР
	               |			КОГДА ТаблСчетов.СчетМУ = ТаблСчетов.СчетЗатратМУ
	               |				ТОГДА ХозрасчетныйОбороты.КорСубконто1
	               |			ИНАЧЕ ТаблСчетов.Субконто1
	               |		КОНЕЦ КАК КорСубконто1,
	               |		ВЫБОР
	               |			КОГДА ТаблСчетов.СчетМУ = ТаблСчетов.СчетЗатратМУ
	               |				ТОГДА ХозрасчетныйОбороты.КорСубконто2
	               |			ИНАЧЕ ТаблСчетов.Субконто2
	               |		КОНЕЦ КАК КорСубконто2,
	               |		СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
	               |		ТаблСчетов.Субконто1 КАК ДопСубконто1,
	               |		ТаблСчетов.Субконто2 КАК ДопСубконто2
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |				&НачПер,
	               |				&КонПер,
	               |				,
	               |				Счет = &Счет76Бух,
	               |				,
	               |				,
	               |				КорСчет В
	               |					(ВЫБРАТЬ
	               |						таблсчетов.СчетБУ
	               |					ИЗ
	               |						таблсчетов),
	               |				) КАК ХозрасчетныйОбороты
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблСчетов КАК ТаблСчетов
	               |			ПО ХозрасчетныйОбороты.КорСчет = ТаблСчетов.СчетБУ
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ХозрасчетныйОбороты.Субконто1,
	               |		ХозрасчетныйОбороты.Субконто2,
	               |		ТаблСчетов.СчетЗатратМУ,
	               |		ВЫБОР
	               |			КОГДА ТаблСчетов.СчетМУ = ТаблСчетов.СчетЗатратМУ
	               |				ТОГДА ХозрасчетныйОбороты.КорСубконто1
	               |			ИНАЧЕ ТаблСчетов.Субконто1
	               |		КОНЕЦ,
	               |		ВЫБОР
	               |			КОГДА ТаблСчетов.СчетМУ = ТаблСчетов.СчетЗатратМУ
	               |				ТОГДА ХозрасчетныйОбороты.КорСубконто2
	               |			ИНАЧЕ ТаблСчетов.Субконто2
	               |		КОНЕЦ,
	               |		ТаблСчетов.Субконто1,
	               |		ТаблСчетов.Субконто2
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		МеждународныйОбороты.Субконто1,
	               |		МеждународныйОбороты.Субконто2,
	               |		ТаблСчетов.СчетЗатратМУ,
	               |		ВЫБОР
	               |			КОГДА ТаблСчетов.СчетМУ = ТаблСчетов.СчетЗатратМУ
	               |				ТОГДА МеждународныйОбороты.КорСубконто1
	               |			ИНАЧЕ ТаблСчетов.Субконто1
	               |		КОНЕЦ,
	               |		ВЫБОР
	               |			КОГДА ТаблСчетов.СчетМУ = ТаблСчетов.СчетЗатратМУ
	               |				ТОГДА МеждународныйОбороты.КорСубконто2
	               |			ИНАЧЕ ТаблСчетов.Субконто2
	               |		КОНЕЦ,
	               |		СУММА(-1*МеждународныйОбороты.СуммаОборот),
	               |		ТаблСчетов.Субконто1,
	               |		ТаблСчетов.Субконто2
	               |	ИЗ
	               |		РегистрБухгалтерии.Международный.Обороты(
	               |				&начПер,
	               |				&КонПер,
	               |				,
	               |				Счет = &Счет76МСФО,
	               |				,
	               |				,
	               |				КорСчет В
	               |					(ВЫБРАТЬ
	               |						таблсчетов.СчетМУ
	               |					ИЗ
	               |						таблсчетов),
	               |				) КАК МеждународныйОбороты
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблСчетов КАК ТаблСчетов
	               |			ПО МеждународныйОбороты.КорСчет = ТаблСчетов.СчетМУ
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		МеждународныйОбороты.Субконто1,
	               |		МеждународныйОбороты.Субконто2,
	               |		ТаблСчетов.СчетЗатратМУ,
	               |		ВЫБОР
	               |			КОГДА ТаблСчетов.СчетМУ = ТаблСчетов.СчетЗатратМУ
	               |				ТОГДА МеждународныйОбороты.КорСубконто1
	               |			ИНАЧЕ ТаблСчетов.Субконто1
	               |		КОНЕЦ,
	               |		ВЫБОР
	               |			КОГДА ТаблСчетов.СчетМУ = ТаблСчетов.СчетЗатратМУ
	               |				ТОГДА МеждународныйОбороты.КорСубконто2
	               |			ИНАЧЕ ТаблСчетов.Субконто2
	               |		КОНЕЦ,
	               |		ТаблСчетов.Субконто1,
	               |		ТаблСчетов.Субконто2) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.КорСубконто1,
	               |	ВложенныйЗапрос.Субконто1,
	               |	ВложенныйЗапрос.Субконто2,
	               |	ВложенныйЗапрос.КорСубконто2,
	               |	ВложенныйЗапрос.КорСчет,
	               |	ВложенныйЗапрос.ДопСубконто1,
	               |	ВложенныйЗапрос.ДопСубконто2
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВложенныйЗапрос.СуммаОборот) <> 0";
	//начало изменений Ожиганов 23.05.2017 65591 изменение алгоритма в части закрытия 76 счета документом  
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВложенныйЗапрос.КодСчета КАК КодСчета,
	//|	ВложенныйЗапрос.Субконто1,
	//|	ВложенныйЗапрос.Субконто2,
	//|	СУММА(ВложенныйЗапрос.СуммаКонечныйОстатокРСБУ) КАК СуммаКонечныйОстатокРСБУ,
	//|	СУММА(ВложенныйЗапрос.СуммаКонечныйОстатокМСФО) КАК СуммаКонечныйОстатокМСФО,
	//|	СУММА(ВложенныйЗапрос.СуммаКонечныйОстатокРСБУ - ВложенныйЗапрос.СуммаКонечныйОстатокМСФО) КАК РазницаОстатков
	//|ПОМЕСТИТЬ ВТ_Остатки
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ХозрасчетныйОстаткиИОбороты.Счет.Код КАК КодСчета,
	//|		ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Субконто1,
	//|		ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Субконто2,
	//|		СУММА(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстатокРСБУ,
	//|		0 КАК СуммаКонечныйОстатокМСФО
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПер, &КонПер, Период, , Счет В ИЕРАРХИИ (&Счет76Бух), , Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ХозрасчетныйОстаткиИОбороты.Счет.Код,
	//|		ХозрасчетныйОстаткиИОбороты.Субконто1,
	//|		ХозрасчетныйОстаткиИОбороты.Субконто2
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		МеждународныйОстаткиИОбороты.Счет.Код,
	//|		МеждународныйОстаткиИОбороты.Субконто1,
	//|		МеждународныйОстаткиИОбороты.Субконто2,
	//|		0,
	//|		СУММА(МеждународныйОстаткиИОбороты.СуммаКонечныйОстаток)
	//|	ИЗ
	//|		РегистрБухгалтерии.Международный.ОстаткиИОбороты(&НачПер, &КонПер, Период, , Счет В ИЕРАРХИИ (&Счет76МСФО), , Организация = &Организация) КАК МеждународныйОстаткиИОбороты
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		МеждународныйОстаткиИОбороты.Счет.Код,
	//|		МеждународныйОстаткиИОбороты.Субконто1,
	//|		МеждународныйОстаткиИОбороты.Субконто2) КАК ВложенныйЗапрос
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВложенныйЗапрос.КодСчета,
	//|	ВложенныйЗапрос.Субконто1,
	//|	ВложенныйЗапрос.Субконто2
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(ВложенныйЗапрос.СуммаКонечныйОстатокРСБУ - ВложенныйЗапрос.СуммаКонечныйОстатокМСФО) <> 0
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Остатки.КодСчета КАК КодСчета,
	//|	ВТ_Остатки.Субконто1 КАК Субконто1,
	//|	ВТ_Остатки.Субконто2 КАК Субконто2,
	//|	ВТ_Остатки.СуммаКонечныйОстатокРСБУ,
	//|	ВТ_Остатки.СуммаКонечныйОстатокМСФО,
	//|	ВТ_Остатки.РазницаОстатков,
	//|	МеждународныйОбороты.Счет КАК КорСчет,
	//|	МеждународныйОбороты.Субконто1 КАК КорСубконто1,
	//|	МеждународныйОбороты.Субконто2 КАК КорСубконто2,
	//|	МеждународныйОбороты.Субконто3 КАК КорСубконто3
	//|ИЗ
	//|	ВТ_Остатки КАК ВТ_Остатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Международный.Обороты(&НачПер, &КонПер, Период, Счет = &Сч44МСФО, , Организация = &Организация, КорСчет В ИЕРАРХИИ (&Счет76МСФО), ) КАК МеждународныйОбороты
	//|		ПО ВТ_Остатки.КодСчета = МеждународныйОбороты.КорСчет.Код
	//|			И ВТ_Остатки.Субконто1 = МеждународныйОбороты.КорСубконто1
	//|			И ВТ_Остатки.Субконто2 = МеждународныйОбороты.КорСубконто2";
	
	//конец изменений  
	Сч44МУ   = ПланыСчетов.Международный.НайтиПоКоду("44.02");
	Сч7605МУ = ПланыСчетов.Международный.НайтиПоКоду("76.05");
	Сч9007   = ПланыСчетов.Международный.НайтиПоКоду("90.07");
	
	ОтделТоргМаркетингаЦО = Справочники.ПодразделенияОрганизаций.НайтиПоКоду("ЗЦО_1007");
	СтатьяПромо      = Справочники.СтатьиЗатрат.НайтиПоКоду("000010861");
	
    //СписокСчетовНоменклатурыБУ = Новый Массив;
    //СписокСчетовНоменклатурыБУ.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("41.04"));
    //СписокСчетовНоменклатурыБУ.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("43"));
    //СписокСчетовНоменклатурыМУ = Новый Массив;
    //СписокСчетовНоменклатурыМУ.Добавить(ПланыСчетов.Международный.НайтиПоКоду("41.04"));
    //СписокСчетовНоменклатурыМУ.Добавить(ПланыСчетов.Международный.НайтиПоКоду("43"));
	//
	//начало изменений Ожиганов 23.05.2017 65591 изменение алгоритма в части закрытия 76 счета документом  	
	
	Счет26 = ПланыСчетов.Международный.НайтиПоКоду("26");
	Сч9008   = ПланыСчетов.Международный.НайтиПоКоду("90.08");
	
	Запрос.УстановитьПараметр("Наименование","Соотвествие_счетов_для_закрытие76СетаМСФО");
	Запрос.УстановитьПараметр("НаименованиеАналитики","СоотвествиесчетовИАналитикиДляЗакрытия76счета");
	//конец изменений  
	Запрос.УстановитьПараметр("НачПер",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонПер",мКонГраница);
	Запрос.УстановитьПараметр("Счет76Бух",ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.05"));
	Запрос.УстановитьПараметр("Счет76МСФО",Сч7605МУ);
	Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	//Запрос.УстановитьПараметр("Сч4341Бух",СписокСчетовНоменклатурыБУ);
	//Запрос.УстановитьПараметр("Сч4341МСФО",СписокСчетовНоменклатурыМУ);
	Запрос.УстановитьПараметр("Сч44МСФО",Сч44МУ);
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		
		//ПРИХОД ЗАТРАТ
		Проводка = мПроводкиМУ.Добавить();
		
		Проводка.Период                    = Дата;
		Проводка.Организация               = СтруктураШапкиДокумента.Организация;
		//начало изменений Ожиганов 23.05.2017 65591 изменение алгоритма в части закрытия 76 счета документом  
		Проводка.СчетДт                    = Рез.Корсчет;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Рез.КорСубконто1);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Рез.КорСубконто2);
		
		Если ТипЗнч(Рез.КорСубконто1) = Тип("СправочникСсылка.ПодразделенияОрганизаций")
			или ТипЗнч(Рез.КорСубконто2) = Тип("СправочникСсылка.СтатьиЗатрат")
			или Рез.Корсчет = Счет26
			Тогда
			ТекПодразд = Рез.КорСубконто1;
			ТекСтатьяЗатрат  = Рез.КорСубконто2;
		ИначеЕсли ТипЗнч(Рез.КорСубконто1) = Тип("СправочникСсылка.СтатьиЗатрат")
			или ТипЗнч(Рез.КорСубконто2) = Тип("СправочникСсылка.ПодразделенияОрганизаций")	Тогда
			ТекПодразд = Рез.КорСубконто2;
			ТекСтатьяЗатрат  = Рез.КорСубконто1;
		Иначе
			Сообщить("Не удается определить статью затрат. Обратитесь к программисту");
		КонецЕслИ;	
		
		//Проводка.СчетДт                    = Сч44МУ;
		//Если Рез.КорСчет = Null тогда//проставим аналитику на 44 по умолчанию
		//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтатьяПромо);
		//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ОтделТоргМаркетингаЦО);
		//Иначе//проставим найденную аналитику
		//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Рез.КорСубконто1);
		//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Рез.КорСубконто2);
		//КонецЕсли;
		//конец изменений  
		Проводка.СчетКт                    = Сч7605МУ;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Рез.Субконто1);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Рез.Субконто2);
		Проводка.Сумма                     = -Рез.РазницаОстатков;
		Проводка.Содержание                = "Корр. по разнице в стоимости продукции";
		Проводка.НомерЖурнала              = "ЗК";
		
		Движение = Движения.ЗатратыМеждународныйУчет.Добавить();
		Движение.Период = Дата;
		Движение.Активность = Истина;
		Движение.Организация = СтруктураШапкиДокумента.Организация;
		//начало изменений Ожиганов 23.05.2017 65591 изменение алгоритма в части закрытия 76 счета документом  
		Движение.СчетУчета = Рез.КорСчет;
		Движение.СтатьяЗатрат = ТекСтатьяЗатрат;
		Движение.Подразделение = ТекПодразд;
		
		//Движение.СчетУчета = Сч44МУ;
		//Если Рез.КорСчет = Null тогда
		//	Движение.СтатьяЗатрат = СтатьяПромо;
		//	Движение.Подразделение = ОтделТоргМаркетингаЦО;
		//Иначе
		//	Движение.СтатьяЗатрат = Рез.КорСубконто1;
		//	Движение.Подразделение = Рез.КорСубконто2;
		//КонецЕсли;
		//конец изменений  
		Движение.Сумма = -Рез.РазницаОстатков;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		//СПИСАНИЕ ЗАТРАТ
		
		Проводка = мПроводкиМУ.Добавить();
		Проводка.Период                    = Дата;
		Проводка.Организация               = СтруктураШапкиДокумента.Организация;
		//начало изменений Ожиганов 23.05.2017 65591 изменение алгоритма в части закрытия 76 счета документом  
		//Проводка.СчетДт                    = Сч9007;
		Если Рез.Корсчет = Счет26 Тогда
			Проводка.СчетДт                    = Сч9008;
		Иначе	
			Проводка.СчетДт                    = Сч9007;
		КонецЕслИ;	
		//конец изменений  
		Проводка.Сумма                     = -Рез.РазницаОстатков;
		Проводка.Содержание                = "Распределение коммерческих расходов";
		Проводка.НомерЖурнала              = "ЗК";
		//начало изменений Ожиганов 23.05.2017 65591 изменение алгоритма в части закрытия 76 счета документом  
		Проводка.СчетКт                    = Рез.Корсчет;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Рез.КорСубконто1);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Рез.КорСубконто2);
		
		//Проводка.СчетКт                    = Сч44МУ;
		//Если Рез.КорСчет = Null тогда//проставим аналитику на 44 по умолчанию
		//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтатьяПромо);
		//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ОтделТоргМаркетингаЦО);
		//Иначе//проставим найденную аналитику
		//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Рез.КорСубконто1);
		//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Рез.КорСубконто2);
		//КонецЕсли;
		//конец изменений  
		
		Движение = Движения.ЗатратыМеждународныйУчет.Добавить();
		Движение.Период = Дата;
		Движение.Активность = Истина;
		Движение.Организация = СтруктураШапкиДокумента.Организация;
		//начало изменений Ожиганов 23.05.2017 65591 изменение алгоритма в части закрытия 76 счета документом  
		Движение.СчетУчета = рез.КорСчет;
		Движение.СтатьяЗатрат = ТекСтатьяЗатрат;
		Движение.Подразделение = ТекПодразд;
		
		//Движение.СчетУчета = Сч44МУ;
		//Если Рез.КорСчет = Null тогда
		//	Движение.СтатьяЗатрат = СтатьяПромо;
		//	Движение.Подразделение = ОтделТоргМаркетингаЦО;
		//Иначе
		//	Движение.СтатьяЗатрат = Рез.КорСубконто1;
		//	Движение.Подразделение = Рез.КорСубконто2;
		//КонецЕсли;
		//конец изменений  
		Движение.Сумма = -Рез.РазницаОстатков;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			
	КонецЦикла;
	
	//мПроводкиМУ.Записать(Ложь);
	Движения.ЗатратыМеждународныйУчет.Записать();
    //Изменено Перов Андрей 25.10.2017 - есть отдельная процедура по закрытию счета	
	//////////////СЧЕТ 76.02.2
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВложенныйЗапрос.Субконто1,
	//|	ВложенныйЗапрос.Субконто2,
	//|	СУММА(ВложенныйЗапрос.СуммаКонечныйОстатокРСБУ) КАК СуммаКонечныйОстатокРСБУ,
	//|	СУММА(ВложенныйЗапрос.СуммаКонечныйОстатокМСФО) КАК СуммаКонечныйОстатокМСФО,
	//|	СУММА(ВложенныйЗапрос.СуммаКонечныйОстатокРСБУ - ВложенныйЗапрос.СуммаКонечныйОстатокМСФО) КАК РазницаОстатков
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Субконто1,
	//|		ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Субконто2,
	//|		СУММА(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстатокРСБУ,
	//|		0 КАК СуммаКонечныйОстатокМСФО
	//|	ИЗ
	//|		РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПер, &КонПер, Период, , Счет В (&СписокСчетовНоменклатурыБУ_76_Претензии), , Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ХозрасчетныйОстаткиИОбороты.Субконто1,
	//|		ХозрасчетныйОстаткиИОбороты.Субконто2
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		МеждународныйОстаткиИОбороты.Субконто1,
	//|		МеждународныйОстаткиИОбороты.Субконто2,
	//|		0,
	//|		СУММА(МеждународныйОстаткиИОбороты.СуммаКонечныйОстаток)
	//|	ИЗ
	//|		РегистрБухгалтерии.Международный.ОстаткиИОбороты(&НачПер, &КонПер, Период, , Счет В ИЕРАРХИИ (&Счет76МСФО), , Организация = &Организация) КАК МеждународныйОстаткиИОбороты
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		МеждународныйОстаткиИОбороты.Субконто1,
	//|		МеждународныйОстаткиИОбороты.Субконто2) КАК ВложенныйЗапрос
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВложенныйЗапрос.Субконто1,
	//|	ВложенныйЗапрос.Субконто2
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(ВложенныйЗапрос.СуммаКонечныйОстатокРСБУ - ВложенныйЗапрос.СуммаКонечныйОстатокМСФО) <> 0";
	//
	////>>290716
	//СписокСчетовНоменклатурыБУ_76_Претензии = Новый Массив;
	//СписокСчетовНоменклатурыБУ_76_Претензии.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.02.2"));
	//СписокСчетовНоменклатурыБУ_76_Претензии.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.22"));
	//СписокСчетовНоменклатурыБУ_76_Претензии.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.32"));
	//Запрос.УстановитьПараметр("СписокСчетовНоменклатурыБУ_76_Претензии",СписокСчетовНоменклатурыБУ_76_Претензии);
	////<<
	//
	//Сч76022МУ = ПланыСчетов.Международный.НайтиПоКоду("76.02.2");
	//ОтклонениеСтоимостиМПЗ = Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("Р-4.3.206");
	//Сч9102МУ  = ПланыСчетов.Международный.НайтиПоКоду("91.02");
	//
	//Запрос.УстановитьПараметр("НачПер",НачалоМесяца(Дата));
	//Запрос.УстановитьПараметр("КонПер",мКонГраница);
	////>>290716 Запрос.УстановитьПараметр("Счет76Бух",ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.02.2"));
	//Запрос.УстановитьПараметр("Счет76МСФО",Сч76022МУ);
	//Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	//Рез = Запрос.Выполнить().Выбрать();
	//Пока Рез.Следующий() Цикл
	//	Если Рез.СуммаКонечныйОстатокРСБУ<>0 тогда продолжить КонецЕсли;
	//		
	//	//ПРОЧИЕ РАСХОДЫ
	//	Проводка = мПроводкиМУ.Добавить();
	//	
	//	Проводка.Период                    = Дата;
	//	Проводка.Организация               = СтруктураШапкиДокумента.Организация;
	//	Проводка.СчетДт                    = Сч9102МУ;
	//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ОтклонениеСтоимостиМПЗ);
	//	Проводка.СчетКт                    = Сч76022МУ;
	//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Рез.Субконто1);
	//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Рез.Субконто2);
	//	Проводка.Сумма                     = -Рез.РазницаОстатков;
	//	Проводка.Содержание                = "Отклонение в стиоимости номенклатуры";
	//	Проводка.НомерЖурнала              = "ЗК";
	//	
	//КонецЦикла;
	//Конец изменения
	
	мПроводкиМУ.Записать(Ложь);
	
	
	
	
КонецПроцедуры	

Процедура ПриведениеОборота76_94_в_соответствиеРСБУ(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.КодСчета КАК КодСчета,
	|	ВложенныйЗапрос.Субконто1,
	|	ВложенныйЗапрос.Субконто2,
	|	ВложенныйЗапрос.КорСубконто2,
	|	СУММА(ВложенныйЗапрос.СуммаОборотДтРСБУ - ВложенныйЗапрос.СуммаОборотДтМСФО) КАК СуммаКорректировки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(ХозрасчетныйОбороты.Счет.Код КАК СТРОКА(5))) = ""76.22""
	|				ТОГДА ""76.02.2""
	|			КОГДА (ВЫРАЗИТЬ(ХозрасчетныйОбороты.Счет.Код КАК СТРОКА(5))) = ""76.32""
	|				ТОГДА ""76.02.2""
	|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Код
	|		КОНЕЦ КАК КодСчета,
	|		ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
	|		ХозрасчетныйОбороты.Субконто2 КАК Субконто2,
	|		ХозрасчетныйОбороты.КорСубконто2 КАК КорСубконто2,
	|		СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДтРСБУ,
	|		0 КАК СуммаОборотДтМСФО
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачПер, &КонПер, Период, Счет В ИЕРАРХИИ (&Счет76Бух), , Организация = &Организация, КорСчет = &Сч94Бух, ) КАК ХозрасчетныйОбороты
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ХозрасчетныйОбороты.Субконто1,
	|		ХозрасчетныйОбороты.Субконто2,
	|		ХозрасчетныйОбороты.КорСубконто2,
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(ХозрасчетныйОбороты.Счет.Код КАК СТРОКА(5))) = ""76.22""
	|				ТОГДА ""76.02.2""
	|			КОГДА (ВЫРАЗИТЬ(ХозрасчетныйОбороты.Счет.Код КАК СТРОКА(5))) = ""76.32""
	|				ТОГДА ""76.02.2""
	|			ИНАЧЕ ХозрасчетныйОбороты.Счет.Код
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МеждународныйОбороты.Счет.Код,
	|		МеждународныйОбороты.Субконто1,
	|		МеждународныйОбороты.Субконто2,
	|		МеждународныйОбороты.КорСубконто1,
	|		0,
	|		СУММА(МеждународныйОбороты.СуммаОборотДт)
	|	ИЗ
	|		РегистрБухгалтерии.Международный.Обороты(&НачПер, &КонПер, Период, Счет В ИЕРАРХИИ (&Счет76МСФО), , Организация = &Организация, КорСчет = &Сч94МСФО, ) КАК МеждународныйОбороты
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МеждународныйОбороты.Счет.Код,
	|		МеждународныйОбороты.Субконто1,
	|		МеждународныйОбороты.Субконто2,
	|		МеждународныйОбороты.КорСубконто1) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.КодСчета,
	|	ВложенныйЗапрос.Субконто1,
	|	ВложенныйЗапрос.Субконто2,
	|	ВложенныйЗапрос.КорСубконто2
	|ИТОГИ ПО
	|	КодСчета";	
	
	Сч94 = ПланыСчетов.Международный.НайтиПоКоду("94");
	
	Запрос.УстановитьПараметр("НачПер",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонПер",мКонГраница);
	Запрос.УстановитьПараметр("Счет76Бух",ПланыСчетов.Хозрасчетный.НайтиПоКоду("76"));
	Запрос.УстановитьПараметр("Счет76МСФО",ПланыСчетов.Международный.НайтиПоКоду("76"));
	Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("Сч94Бух",ПланыСчетов.Хозрасчетный.НайтиПоКоду("94"));
	Запрос.УстановитьПараметр("Сч94МСФО",Сч94);
	
	Рез = Запрос.Выполнить();
	ВыборкаСчет = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"КодСчета");
	Пока ВыборкаСчет.Следующий() Цикл
		//>>180716 Степанов 54546 странслировать счет
		//Счет76МСФО = ПланыСчетов.Международный.НайтиПоКоду(ВыборкаСчет.КодСчета);
		Выборка = ВыборкаСчет.Выбрать();
		Пока Выборка.Следующий() цикл
			
			Структура = МеждународныйУчет.ПреобразоватьСчетаБУвСчетМСФО(ПланыСчетов.Хозрасчетный.НайтиПоКоду(ВыборкаСчет.КодСчета), Выборка.Субконто1, Выборка.Субконто2, , Дата);

			Проводка = мПроводкиМУ.Добавить();
			Проводка.Период                    = Дата;
			Проводка.Организация               = СтруктураШапкиДокумента.Организация;
			//>>Проводка.СчетДт                    = Счет76МСФО;
			Проводка.СчетДт                    = Структура.Счет;
			//>>БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Выборка.Субконто1);
			//>>БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Выборка.Субконто2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Структура.Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Структура.Субконто2);
			//<<180716
			Проводка.СчетКт                    = Сч94;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Выборка.КорСубконто2);
			Проводка.Сумма                     = Выборка.СуммаКорректировки;
			Проводка.Содержание                = "Корректировка оборота 76/94";
			Проводка.НомерЖурнала              = "ЗК";
		КонецЦикла;
	КонецЦикла;	
	
	мПроводкиМУ.Записать(Ложь);
	
КонецПроцедуры	

Процедура ЗакрытиеСчета94(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Сч91_02 = ПланыСчетов.Международный.НайтиПоКоду("91.02");
	Сч94    = ПланыСчетов.Международный.НайтиПоКоду("94");
	Недостачи = Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("ВР-1.5");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МеждународныйОстатки.Субконто1,
	|	СУММА(МеждународныйОстатки.СуммаОстатокДт) КАК СуммаОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.Международный.Остатки(&КонецПериода, Счет = &Счет94МУ, , Организация = &Организация) КАК МеждународныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	МеждународныйОстатки.Субконто1";
	
	Запрос.УстановитьПараметр("Счет94МУ",Сч94);
	Запрос.УстановитьПараметр("КонецПериода",мКонГраница);
	Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Проводка = мПроводкиМУ.Добавить();
		Проводка.Период                    = Дата;
		Проводка.Организация               = СтруктураШапкиДокумента.Организация;
		Проводка.СчетДт                    = Сч91_02;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Недостачи);
		Проводка.СчетКт                    = Сч94;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Рез.Субконто1);
		Проводка.Сумма                     = Рез.СуммаОстатокДт;
		Проводка.Содержание                = "Закрытие периода МСФО";
		Проводка.НомерЖурнала              = "ЗК";
	КонецЦикла;	
	
	мПроводкиМУ.Записать(Ложь);

КонецПроцедуры	

Процедура Закрытие90_91(СтруктураШапкиДокумента, Отказ, Заголовок)
	 Сч90_01 = ПланыСчетов.Международный.НайтиПоКоду("90.01");
	 Сч90_02 = ПланыСчетов.Международный.НайтиПоКоду("90.02");
	 Сч90_03 = ПланыСчетов.Международный.НайтиПоКоду("90.03");
	 Сч90_04 = ПланыСчетов.Международный.НайтиПоКоду("90.04");
	 Сч90_05 = ПланыСчетов.Международный.НайтиПоКоду("90.05");
	 Сч90_07 = ПланыСчетов.Международный.НайтиПоКоду("90.07");
	 Сч90_08 = ПланыСчетов.Международный.НайтиПоКоду("90.08");
	 Сч90_09 = ПланыСчетов.Международный.НайтиПоКоду("90.09");
	 Сч91_01 = ПланыСчетов.Международный.НайтиПоКоду("91.01");
	 Сч91_02 = ПланыСчетов.Международный.НайтиПоКоду("91.02");
	 Сч91_09 = ПланыСчетов.Международный.НайтиПоКоду("91.09");
	 Сч99_01 = ПланыСчетов.Международный.НайтиПоКоду("99.01");
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МеждународныйОстатки.Счет КАК Счет,
	|	СУММА(МеждународныйОстатки.СуммаОстатокДт) КАК СуммаОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.Международный.Остатки(&КонецПериода, Счет В (&СчетаМУ), , Организация = &Организация) КАК МеждународныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	МеждународныйОстатки.Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	МеждународныйОстатки.Счет.Код";
	
	СписокСчетовДляЗакрытия = Новый Массив;
	СписокСчетовДляЗакрытия.Добавить(Сч90_02);
	СписокСчетовДляЗакрытия.Добавить(Сч90_03);
	СписокСчетовДляЗакрытия.Добавить(Сч90_04);
	СписокСчетовДляЗакрытия.Добавить(Сч90_05);
	СписокСчетовДляЗакрытия.Добавить(Сч90_07);
	СписокСчетовДляЗакрытия.Добавить(Сч90_08);
	
	Запрос.УстановитьПараметр("СчетаМУ",СписокСчетовДляЗакрытия);
	Запрос.УстановитьПараметр("КонецПериода",мКонГраница);
	Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Проводка = мПроводкиМУ.Добавить();
		Проводка.Период                    = Дата;
		Проводка.Организация               = СтруктураШапкиДокумента.Организация;
		Проводка.СчетДт                    = Сч90_09;
		Проводка.СчетКт                    = Рез.Счет;
		Проводка.Сумма                     = Рез.СуммаОстатокДт;
		Проводка.Содержание                = "Закрытие периода МСФО";
		Проводка.НомерЖурнала              = "ЗК";
	КонецЦикла;	
	
	мПроводкиМУ.Записать(Ложь);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МеждународныйОстатки.Счет КАК Счет,
	|	СУММА(МеждународныйОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
	|ИЗ
	|	РегистрБухгалтерии.Международный.Остатки(&КонецПериода, Счет = &Счет90_01, , Организация = &Организация) КАК МеждународныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	МеждународныйОстатки.Счет";
	
	Запрос.УстановитьПараметр("Счет90_01",Сч90_01);
	Запрос.УстановитьПараметр("КонецПериода",мКонГраница);
	Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Проводка = мПроводкиМУ.Добавить();
		Проводка.Период                    = Дата;
		Проводка.Организация               = СтруктураШапкиДокумента.Организация;
		Проводка.СчетДт                    = Сч90_01;
		Проводка.СчетКт                    = Сч90_09;
		Проводка.Сумма                     = Рез.СуммаОстатокКт;
		Проводка.Содержание                = "Закрытие периода МСФО";
		Проводка.НомерЖурнала              = "ЗК";
	КонецЦикла;	
	
	мПроводкиМУ.Записать(Ложь);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МеждународныйОстатки.Счет КАК Счет,
	|	СУММА(ЕСТЬNULL(МеждународныйОстатки.СуммаОстатокДт, 0)) КАК СуммаОстатокДт,
	|	СУММА(ЕСТЬNULL(МеждународныйОстатки.СуммаОстатокКт, 0)) КАК СуммаОстатокКт
	|ИЗ
	|	РегистрБухгалтерии.Международный.Остатки(&КонецПериода, Счет = &Счет90_09, , Организация = &Организация) КАК МеждународныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	МеждународныйОстатки.Счет";
	Запрос.УстановитьПараметр("Счет90_09",Сч90_09);
	Запрос.УстановитьПараметр("КонецПериода",мКонГраница);
	Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Проводка = мПроводкиМУ.Добавить();
		Проводка.Период                    = Дата;
		Проводка.Организация               = СтруктураШапкиДокумента.Организация;
		Если Рез.СуммаОстатокДт>0 тогда
			Проводка.СчетДт                    = Сч99_01;
			Проводка.СчетКт                    = Сч90_09;
			Проводка.Сумма                     = Рез.СуммаОстатокДт;
			Проводка.Содержание                = "Закрытие периода МСФО";
			Проводка.НомерЖурнала              = "ЗК";
		КонецЕсли;
		Если Рез.СуммаОстатокКт>0 тогда
			Проводка.СчетДт                    = Сч90_09;
			Проводка.СчетКт                    = Сч99_01;
			Проводка.Сумма                     = Рез.СуммаОстатокКт;
			Проводка.Содержание                = "Закрытие периода МСФО";
			Проводка.НомерЖурнала              = "ЗК";
		КонецЕсли;
	КонецЦикла;	
	
	мПроводкиМУ.Записать(Ложь);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МеждународныйОстатки.Счет КАК Счет,
	|	СУММА(МеждународныйОстатки.СуммаОстатокКт) КАК СуммаОстатокКт
	|ИЗ
	|	РегистрБухгалтерии.Международный.Остатки(&КонецПериода, Счет = &Счет91_01, , Организация = &Организация) КАК МеждународныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	МеждународныйОстатки.Счет";
	
	Запрос.УстановитьПараметр("Счет91_01",Сч91_01);
	Запрос.УстановитьПараметр("КонецПериода",мКонГраница);
	Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Проводка = мПроводкиМУ.Добавить();
		Проводка.Период                    = Дата;
		Проводка.Организация               = СтруктураШапкиДокумента.Организация;
		Проводка.СчетДт                    = Сч91_01;
		Проводка.СчетКт                    = Сч91_09;
		Проводка.Сумма                     = Рез.СуммаОстатокКт;
		Проводка.Содержание                = "Закрытие периода МСФО";
		Проводка.НомерЖурнала              = "ЗК";
	КонецЦикла;	
	
	мПроводкиМУ.Записать(Ложь);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МеждународныйОстатки.Счет КАК Счет,
	|	СУММА(МеждународныйОстатки.СуммаОстатокДт) КАК СуммаОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.Международный.Остатки(&КонецПериода, Счет = &Счет91_02, , Организация = &Организация) КАК МеждународныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	МеждународныйОстатки.Счет";
	
	Запрос.УстановитьПараметр("Счет91_02",Сч91_02);
	Запрос.УстановитьПараметр("КонецПериода",мКонГраница);
	Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Проводка = мПроводкиМУ.Добавить();
		Проводка.Период                    = Дата;
		Проводка.Организация               = СтруктураШапкиДокумента.Организация;
		Проводка.СчетДт                    = Сч91_09;
		Проводка.СчетКт                    = Сч91_02;
		Проводка.Сумма                     = Рез.СуммаОстатокДт;
		Проводка.Содержание                = "Закрытие периода МСФО";
		Проводка.НомерЖурнала              = "ЗК";
	КонецЦикла;	
	
	мПроводкиМУ.Записать(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МеждународныйОстатки.Счет КАК Счет,
	|	СУММА(ЕСТЬNULL(МеждународныйОстатки.СуммаОстатокДт, 0)) КАК СуммаОстатокДт,
	|	СУММА(ЕСТЬNULL(МеждународныйОстатки.СуммаОстатокКт, 0)) КАК СуммаОстатокКт
	|ИЗ
	|	РегистрБухгалтерии.Международный.Остатки(&КонецПериода, Счет = &Счет91_09, , Организация = &Организация) КАК МеждународныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	МеждународныйОстатки.Счет";
	Запрос.УстановитьПараметр("Счет91_09",Сч91_09);
	Запрос.УстановитьПараметр("КонецПериода",мКонГраница);
	Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Проводка = мПроводкиМУ.Добавить();
		Проводка.Период                    = Дата;
		Проводка.Организация               = СтруктураШапкиДокумента.Организация;
		Если Рез.СуммаОстатокДт>0 тогда
			Проводка.СчетДт                    = Сч99_01;
			Проводка.СчетКт                    = Сч91_09;
			Проводка.Сумма                     = Рез.СуммаОстатокДт;
			Проводка.Содержание                = "Закрытие периода МСФО";
			Проводка.НомерЖурнала              = "ЗК";
		КонецЕсли;
		Если Рез.СуммаОстатокКт>0 тогда
			Проводка.СчетДт                    = Сч91_09;
			Проводка.СчетКт                    = Сч99_01;
			Проводка.Сумма                     = Рез.СуммаОстатокКт;
			Проводка.Содержание                = "Закрытие периода МСФО";
			Проводка.НомерЖурнала              = "ЗК";
		КонецЕсли;
	КонецЦикла;	
	
	мПроводкиМУ.Записать(Ложь);
	
КонецПроцедуры

//начало изменений Ожиганов А. 19.07.2017 68038 приравнивание остатков к БУ счета 76.02.2, 76.22, 76.32 
Процедура ЗакрытиеОстатковПоСчету76_02_2(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВложенныйЗапрос.Субконто1,
	                      |	ВложенныйЗапрос.Субконто2,
	                      |	СУММА(ВложенныйЗапрос.СуммаОстаток) КАК СуммаОстаток,
	                      |	СУММА(ВложенныйЗапрос.ВалютнаяСуммаОстаток) КАК ВалютнаяСуммаОстаток,
	                      |	ВложенныйЗапрос.Валюта,
	                      |	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Валюта)
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	                      |		ХозрасчетныйОстатки.Субконто2 КАК Субконто2,
	                      |		ВЫБОР
	                      |			КОГДА ХозрасчетныйОстатки.Валюта ЕСТЬ NULL 
	                      |					ИЛИ ХозрасчетныйОстатки.Валюта = НЕОПРЕДЕЛЕНО
	                      |				ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	                      |			ИНАЧЕ ХозрасчетныйОстатки.Валюта
	                      |		КОНЕЦ КАК Валюта,
	                      |		ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток,
	                      |		ХозрасчетныйОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток
	                      |	ИЗ
	                      |		РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет = &Счет76_2_2БУ, , Организация = &Организация) КАК ХозрасчетныйОстатки
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		МеждународныйОстатки.Субконто1,
	                      |		МеждународныйОстатки.Субконто2,
	                      |		МеждународныйОстатки.Валюта,
	                      |		-1 * МеждународныйОстатки.СуммаОстаток,
	                      |		-1 * МеждународныйОстатки.ВалютнаяСуммаОстаток
	                      |	ИЗ
	                      |		РегистрБухгалтерии.Международный.Остатки(&Дата, Счет = &счет76_2_2МУ, , Организация = &Организация) КАК МеждународныйОстатки) КАК ВложенныйЗапрос
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.Субконто1,
	                      |	ВложенныйЗапрос.Субконто2,
	                      |	ВложенныйЗапрос.Валюта
	                      |
	                      |ИМЕЮЩИЕ
	                      |	(СУММА(ВложенныйЗапрос.СуммаОстаток) <> 0
	                      |		ИЛИ СУММА(ВложенныйЗапрос.ВалютнаяСуммаОстаток) <> 0)");
						  
	Счет76_2_2БУ = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.02.2");
	Счет76_2_2МУ = ПланыСчетов.Международный.НайтиПоКоду("76.02.2");
	
	Запрос.УстановитьПараметр("Счет76_2_2БУ",Счет76_2_2БУ);
	Запрос.УстановитьПараметр("Счет76_2_2МУ",Счет76_2_2МУ);
	Запрос.УстановитьПараметр("Дата",КонецДня(Дата)+1);
	Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	
	счет91_02  = ПланыСчетов.Международный.НайтиПоКоду("91.02");
	счет91_01  = ПланыСчетов.Международный.НайтиПоКоду("91.01");
	
	ЗапросПоСтатье = Новый Запрос("ВЫБРАТЬ
	                              |	ВЫРАЗИТЬ(ПРГ_Служебный.Объект КАК Справочник.ПрочиеДоходыИРасходы) КАК Статья
	                              |ИЗ
	                              |	Справочник.ПРГ_Служебный КАК ПРГ_Служебный
	                              |ГДЕ
	                              |	ПРГ_Служебный.Наименование = ""Отклонение_В_Стоимости_ТМЦ""");
								  
	ВыборкаПоСтатье	= ЗапросПоСтатье.Выполнить().Выбрать();					  
	Если ВыборкаПоСтатье.Следующий() Тогда
		//Р-4.3.207
		СтатьяОтклонениеВСтоимостиМПЗ = ВыборкаПоСтатье.Статья; 
	Иначе 
		Сообщить("В справочнике не задана статья отклонения стоимости ТМЦ!!! Проводки по отклонениям будут сформированы на пустую статью");
	КонецЕсли;	
	
	Выборка  = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		возврат;
	КонецЕсли;	
	
	Пока Выборка.Следующий() Цикл
		Дт = Ложь;
		
		Если Выборка.СуммаОстаток = 0 Тогда
			Если Выборка.ВалютнаяСуммаОстаток> 0 Тогда
				Дт = Истина;
			КонецЕслИ;	
		Иначе 
			Если Выборка.СуммаОстаток  > 0 Тогда
				Дт = истина
			КонецЕслИ;	
		КонецЕслИ;	
		
		Проводка = мПроводкиМУ.Добавить();
		Проводка.Активность   = Истина;
		Проводка.Период 	    = Дата;
		Проводка.Содержание     = "Закрытие периода МСФО";
		Проводка.НомерЖурнала   = "ЗК";
		Проводка.Организация    = СтруктураШапкиДокумента.Организация;
		
		Если Дт Тогда
			Проводка.СчетДт = Счет76_2_2МУ;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Выборка.Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Выборка.Субконто2);
			
			Проводка.СчетКт = счет91_01;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтатьяОтклонениеВСтоимостиМПЗ);
			
			Проводка.ВалютаДт			= Выборка.Валюта;
			Проводка.ВалютнаяСуммаДт	= Выборка.ВалютнаяСуммаОстаток;
			Проводка.Сумма				= Выборка.СуммаОстаток;
		Иначе 	
			
			Проводка.СчетКт = Счет76_2_2МУ;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Выборка.Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Выборка.Субконто2);
			
			Проводка.СчетДт = счет91_02;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтатьяОтклонениеВСтоимостиМПЗ);
			
			Проводка.ВалютаКт			= Выборка.Валюта;
			Проводка.ВалютнаяСуммаКт	= -1*Выборка.ВалютнаяСуммаОстаток;
			Проводка.Сумма				= -1*Выборка.СуммаОстаток;
			
		КонецЕслИ;	
	КонецЦикла;	
	
	мПроводкиМУ.Записать(Ложь);
	
КонецПроцедуры	

Процедура ЗакрытиеОстатковПоСчету76_22_76_32(счетБУ,СчетМУ,СтатьяРазниц,СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВложенныйЗапрос.Субконто1,
	                      |	ВложенныйЗапрос.Субконто2,
	                      |	СУММА(ВложенныйЗапрос.СуммаОстаток) КАК СуммаОстаток,
	                      |	ВложенныйЗапрос.Валюта,
	                      |	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Валюта)
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	                      |		ХозрасчетныйОстатки.Субконто2 КАК Субконто2,
	                      |		ХозрасчетныйОстатки.Валюта КАК Валюта,
	                      |		ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток
	                      |	ИЗ
	                      |		РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет = &счетБУ, , Организация = &Организация) КАК ХозрасчетныйОстатки
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		МеждународныйОстатки.Субконто1,
	                      |		МеждународныйОстатки.Субконто2,
	                      |		МеждународныйОстатки.Валюта,
	                      |		-1 * МеждународныйОстатки.СуммаОстаток
	                      |	ИЗ
	                      |		РегистрБухгалтерии.Международный.Остатки(&Дата, Счет = &счетМУ, , Организация = &Организация) КАК МеждународныйОстатки) КАК ВложенныйЗапрос
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.Субконто1,
	                      |	ВложенныйЗапрос.Субконто2,
	                      |	ВложенныйЗапрос.Валюта
	                      |
	                      |ИМЕЮЩИЕ
	                      |	СУММА(ВложенныйЗапрос.СуммаОстаток) <> 0");
						  
	Запрос.УстановитьПараметр("СчетБУ",СчетБУ);
	Запрос.УстановитьПараметр("СчетМУ",СчетМУ);
	
	Запрос.УстановитьПараметр("Дата",КонецДня(Дата)+1);
	Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	
	счет91_02  = ПланыСчетов.Международный.НайтиПоКоду("91.02");
	счет91_01  = ПланыСчетов.Международный.НайтиПоКоду("91.01");
	
	
	Выборка  = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		возврат;
	КонецЕсли;	
	Пока Выборка.Следующий() Цикл
				
		Если Выборка.СуммаОстаток  =  0 Тогда
			продолжить;
		КонецЕслИ;	
		
		Проводка = мПроводкиМУ.Добавить();
		Проводка.Активность   = Истина;
		Проводка.Период 	    = Дата;
		Проводка.Содержание     = "Закрытие периода МСФО";
		Проводка.НомерЖурнала   = "ЗК";
		Проводка.Организация    = СтруктураШапкиДокумента.Организация;
		
		Если Выборка.СуммаОстаток  >  0 Тогда
			Проводка.СчетДт = СчетМУ;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Выборка.Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Выборка.Субконто2);
			
			Проводка.СчетКт = счет91_01;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтатьяРазниц);
			
			Проводка.ВалютаДт			= Выборка.Валюта;
			
			Проводка.Сумма				= Выборка.СуммаОстаток;
		Иначе 	
			
			Проводка.СчетКт = СчетМУ;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Выборка.Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Выборка.Субконто2);
			
			Проводка.СчетДт = счет91_02;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтатьяРазниц);
			
			Проводка.ВалютаКт			= Выборка.Валюта;
			
			Проводка.Сумма				= -1*Выборка.СуммаОстаток;
			
		КонецЕслИ;	
		
	КонецЦикла;	
	
	мПроводкиМУ.Записать(Ложь);	
КонецПроцедуры

//конец изменений 

// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок)
	мПроводкиМУ = Движения.Международный;
	//ПроведениеРеформацииБаланса(СтруктураШапкиДокумента, Отказ, Заголовок);
	Если ФлОборот76_44 тогда
		ПриведениеОборота76_44_в_соответствиеРСБУ(СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;	
	Если ФлОборот76_94 тогда
		ПриведениеОборота76_94_в_соответствиеРСБУ(СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	Если ФлЗакрытие94 тогда
		ЗакрытиеСчета94(СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	
	//начало изменений Ожиганов А. 19.07.2017 68038 приравнивание остатков к БУ счета 76.02.2, 76.22, 76.32 
	Если флЗакрытияОстатка76_2_2 тогда
		 ЗакрытиеОстатковПоСчету76_02_2(СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;	

	Если флЗакрытияОстатка76_22 тогда
		ЗакрытиеОстатковПоСчету76_22_76_32(ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.22"),
										   ПланыСчетов.Международный.НайтиПоКоду("76.22"),
										   Справочники.ПрочиеДоходыИРасходы.КурсовыеРазницы,
										   СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;	
	Если  флЗакрытияОстатка76_32 тогда
		ЗакрытиеОстатковПоСчету76_22_76_32(ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.32"),
										   ПланыСчетов.Международный.НайтиПоКоду("76.32"),
										   Справочники.ПрочиеДоходыИРасходы.КурсовыеРазницыПоРасчетамВУЕ,
										   СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕслИ;	
	//конец изменений 
	
	Если ФлЗакрытие90_91 тогда
		Закрытие90_91(СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	мКонДата    = КонецМесяца (Дата);
	мКонГраница = Новый Граница(мКонДата, ВидГраницы.Включая);
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	Заголовок = "";
	//ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью
